chriskinal/QuailTracker/stm32/QuailTracker_U575/Core/Src/ble_proto_handlers.c
/*
 * QuailTracker - GPS-synchronized Autonomous Recording Unit
 * Copyright (C) 2026 QuailTracker Project
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

/* Protobuf message encoding/decoding and command dispatch for BLE protocol.
 *
 * Implements two extern functions called by ble_proto.c:
 *   ble_proto_dispatch()  — decode incoming protobuf messages, handle commands
 *   ble_proto_push_topic() — encode and send a push message for a given topic
 */

#include "ble_proto.h"
#include "quailtracker.pb.h"
#include "main.h"        /* FW_VERSION */
#include "fatfs.h"
#include "user_diskio.h"
#include "mel_spectrogram.h"

#include <pb_encode.h>
#include <pb_decode.h>
#include <string.h>
#include <stdio.h>

#include "cmsis_os2.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_hal_mdf.h"

/* ---- Command defines (must match app_freertos.c) ---- */
#define CMD_START_REC  1
#define CMD_STOP_REC   2
#define REC_FMT_FLAC   0
#define REC_FMT_WAV    1
#define MISSION_RECORD  0
#define SURVEY_MIN_SATS 4

/* ---- Ring buffer sizes (must match app_freertos.c) ---- */
#define PCM_RING_SIZE   16384
#define SAMPLE_RATE     48000

/* ---- GPS data type ---- */
typedef struct {
    uint8_t  fix;
    uint8_t  satellites;
    float    latitude;
    float    longitude;
    float    altitude;
    uint32_t utc_time;
    uint32_t utc_date;
    uint8_t  valid;
} gps_data_t;

/* ---- Extern variables from app_freertos.c / main.c ---- */
extern uint8_t sdMounted, isRecording, audioStarted, recFormat;
extern uint32_t totalDataBytes, ringOverruns;
extern volatile int32_t audioPeakLevel;
extern volatile uint8_t actRatio;
extern uint32_t limiterClipCount;
extern volatile uint32_t ringHead;
extern uint32_t ringTail;
extern char recFilename[];

extern osMutexId_t fileMtxHandle;
extern osMessageQueueId_t audioCmdQueueHandle;
extern osThreadId_t inferenceTaskHandle;

extern int16_t  sht30TempC100;
extern uint16_t sht30HumRH100;
extern void sht30Read(void);

extern uint32_t battReadMv(void);

/* GPS */
extern gps_data_t gpsData;
extern volatile uint8_t ppsSynced;
extern volatile uint32_t ppsCount, ppsTick;
extern uint32_t ppsUtcDate, ppsUtcTime;

/* Detection */
extern uint32_t detWindowsProcessed, detHits;
extern char detLastSpecies[];
extern uint8_t detLastConf;
extern char detLastTime[];

/* Model */
extern uint8_t modelLoaded;
extern uint32_t modelBufSize;
extern int modelNumLabels;

/* Config */
typedef struct __attribute__((packed, aligned(16))) {
    uint32_t magic;
    uint8_t  version;
    char     stationId[16];
    uint8_t  gain;
    uint16_t bpfLow;
    uint16_t bpfHigh;
    uint8_t  recFormat;
    uint8_t  sunriseEnabled;
    uint16_t sunriseBefore;
    uint16_t sunriseAfter;
    uint8_t  sunsetEnabled;
    uint16_t sunsetBefore;
    uint16_t sunsetAfter;
    uint8_t  numWindows;
    uint16_t windows[16];
    uint8_t  trigEnabled;
    int8_t   trigDb;
    uint8_t  trigPre;
    uint8_t  trigPost;
    uint8_t  lowBatPct;
    uint8_t  autoStop;
    uint8_t  activityMode;
    uint8_t  activityMinPct;
    uint8_t  activityMaxPct;
    uint8_t  activityHoldSec;
    float    surveyLat;
    float    surveyLon;
    float    surveyAlt;
    uint32_t surveyCount;
    uint8_t  missionMode;
    uint8_t  detConfThresh;
    uint8_t  detWindowStep;
    uint8_t  chunkMinutes;
    uint8_t  _pad[128 - 100 - 4];
    uint32_t crc32;
} device_config_t;

extern device_config_t cfg;
extern int configSave(void);

/* Survey */
extern uint8_t surveyActive;
extern uint32_t surveyStartTick;

/* FatFS */
extern FATFS USERFatFS;
extern char USERPath[];
extern void USER_disk_deinit(void);
extern int formatSD(void);

/* BLE state */
extern uint8_t bleReady;
extern char bleName[];
extern char bleAddr[];

/* Log forwarding */
extern volatile uint8_t bleLogEnabled;
extern volatile uint16_t bleLogHead, bleLogTail;

/* ADF gain */
extern MDF_HandleTypeDef AdfHandle0;

/* Health statistics (defined in app_freertos.c) */
typedef struct __attribute__((packed, aligned(16))) {
    uint32_t magic;
    uint8_t  version;
    uint32_t filesWritten;
    uint64_t totalBytes;
    uint32_t recordingSecs;
    char     lastFilename[40];
    uint32_t lastFileBytes;
    uint32_t lastFileSecs;
    uint32_t writeErrors;
    uint32_t detections;
    char     lastSpecies[32];
    uint8_t  lastConfidence;
    char     lastDetTime[16];
    uint32_t battMinMv;
    uint32_t battMaxMv;
    int32_t  tempMinC100;
    int32_t  tempMaxC100;
    uint32_t bootCount;
    uint32_t sdErrors;
    uint32_t gpsFixLosses;
    uint32_t uptimeStartTick;
    uint8_t  _pad[256 - 158 - 4];
    uint32_t crc32;
} health_stats_t;
extern health_stats_t health;

/* Subscription management (defined in ble_proto.c) */
extern void ble_proto_add_subscription(uint8_t topic, uint32_t interval_ms);
extern void ble_proto_remove_subscription(uint8_t topic);

/* ---- Helpers ---- */

/* Send a CommandAck with success=true */
static void send_ack(quailtracker_CommandType cmd_type)
{
    quailtracker_CommandAck ack = quailtracker_CommandAck_init_zero;
    ack.type = cmd_type;
    ack.success = true;

    uint8_t buf[quailtracker_CommandAck_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    pb_encode(&stream, quailtracker_CommandAck_fields, &ack);
    ble_proto_send(TOPIC_COMMAND_ACK, buf, stream.bytes_written);
}

/* Send a CommandAck with success=false and an error message */
static void send_nack(quailtracker_CommandType cmd_type, const char *err)
{
    quailtracker_CommandAck ack = quailtracker_CommandAck_init_zero;
    ack.type = cmd_type;
    ack.success = false;
    strncpy(ack.error, err, sizeof(ack.error) - 1);

