chriskinal/QuailTracker/stm32/QuailTracker_U575/Core/Src/ble_proto_handlers.c
    uint8_t buf[quailtracker_CommandAck_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    pb_encode(&stream, quailtracker_CommandAck_fields, &ack);
    ble_proto_send(TOPIC_COMMAND_ACK, buf, stream.bytes_written);
}

/* Read SD free/total KB.  Returns 0,0 if unmounted or locked. */
static void get_sd_space(uint32_t *total_kb, uint32_t *free_kb)
{
    *total_kb = 0;
    *free_kb = 0;
    if (!sdMounted) return;

    FATFS *fs;
    DWORD fre_clust;
    if (osMutexAcquire(fileMtxHandle, 200) == osOK) {
        if (f_getfree("", &fre_clust, &fs) == FR_OK) {
            DWORD tot_sect = (fs->n_fatent - 2) * fs->csize;
            DWORD fre_sect = fre_clust * fs->csize;
            *total_kb = (uint32_t)(tot_sect / 2);
            *free_kb  = (uint32_t)(fre_sect / 2);
        }
        osMutexRelease(fileMtxHandle);
    }
}

/* Format GPS UTC time string: "YYYYMMDDHHmmss" from PPS date/time */
static void format_utc_string(char *out, size_t out_size)
{
    if (ppsSynced && ppsUtcDate != 0) {
        uint32_t dd = ppsUtcDate / 10000;
        uint32_t mm = (ppsUtcDate / 100) % 100;
        uint32_t yy = ppsUtcDate % 100;
        uint32_t hh = ppsUtcTime / 10000;
        uint32_t mn = (ppsUtcTime / 100) % 100;
        uint32_t ss = ppsUtcTime % 100;
        snprintf(out, out_size, "20%02lu%02lu%02lu%02lu%02lu%02lu",
                 (unsigned long)yy, (unsigned long)mm, (unsigned long)dd,
                 (unsigned long)hh, (unsigned long)mn, (unsigned long)ss);
    } else {
        out[0] = '\0';
    }
}

/* ---- Push topic encoders ---- */

static void push_status(void)
{
    quailtracker_Status msg = quailtracker_Status_init_zero;

    /* Battery */
    uint32_t mv = battReadMv();
    msg.battery_mv = mv;
    int pct = (int)(mv - 3000) * 100 / 1200;
    if (pct < 0) pct = 0;
    if (pct > 100) pct = 100;
    msg.battery_pct = (uint32_t)pct;

    /* BLE */
    msg.ble_ready = bleReady ? true : false;
    strncpy(msg.ble_name, bleName, sizeof(msg.ble_name) - 1);
    strncpy(msg.ble_addr, bleAddr, sizeof(msg.ble_addr) - 1);

    /* SD card */
    msg.sd_mounted = sdMounted ? true : false;
    get_sd_space(&msg.sd_total_kb, &msg.sd_free_kb);

    /* Recording */
    msg.recording = isRecording ? true : false;
    strncpy(msg.rec_filename, recFilename, sizeof(msg.rec_filename) - 1);
    msg.rec_bytes = totalDataBytes;
    msg.rec_duration_s = isRecording ? totalDataBytes / (SAMPLE_RATE * 3) : 0;
    msg.rec_overruns = ringOverruns;
    msg.rec_format = (uint32_t)recFormat;

    /* Detection */
    msg.det_active = (cfg.missionMode != MISSION_RECORD && modelLoaded) ? true : false;
    msg.det_windows = detWindowsProcessed;
    msg.det_hits = detHits;
    strncpy(msg.det_last_species, detLastSpecies, sizeof(msg.det_last_species) - 1);
    msg.model_loaded = modelLoaded ? true : false;
    msg.model_size = modelBufSize;
    msg.model_labels = (uint32_t)modelNumLabels;

    /* Environment */
    msg.temperature_c100 = (int32_t)sht30TempC100;
    msg.humidity_rh100 = (uint32_t)sht30HumRH100;

    /* Firmware */
    strncpy(msg.firmware_version, FW_VERSION, sizeof(msg.firmware_version) - 1);
    strncpy(msg.station_id, cfg.stationId, sizeof(msg.station_id) - 1);

    /* Survey-in progress */
    msg.survey_active = surveyActive ? true : false;
    msg.survey_count = cfg.surveyCount;
    if (surveyActive) {
        uint32_t elapsed = (HAL_GetTick() - surveyStartTick) / 1000;
        msg.survey_seconds_left = elapsed < 300 ? 300 - elapsed : 0;
    }
    msg.survey_lat_e7 = (int32_t)(cfg.surveyLat * 10000000.0f);
    msg.survey_lon_e7 = (int32_t)(cfg.surveyLon * 10000000.0f);
    msg.survey_alt_mm = (int32_t)(cfg.surveyAlt * 1000.0f);

    uint8_t buf[quailtracker_Status_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_Status_fields, &msg)) {
        ble_proto_send(TOPIC_STATUS, buf, stream.bytes_written);
    }
}

static void push_gps_fix(void)
{
    quailtracker_GpsFix msg = quailtracker_GpsFix_init_zero;

    msg.valid = gpsData.valid ? true : false;
    msg.satellites = (uint32_t)gpsData.satellites;
    msg.latitude_e7 = (int32_t)(gpsData.latitude * 10000000.0f);
    msg.longitude_e7 = (int32_t)(gpsData.longitude * 10000000.0f);
    msg.altitude_mm = (int32_t)(gpsData.altitude * 1000.0f);
    msg.fix_type = (uint32_t)gpsData.fix;
    msg.pps_synced = ppsSynced ? true : false;
    msg.pps_count = ppsCount;
    format_utc_string(msg.utc_time, sizeof(msg.utc_time));

    uint8_t buf[quailtracker_GpsFix_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_GpsFix_fields, &msg)) {
        ble_proto_send(TOPIC_GPS_FIX, buf, stream.bytes_written);
    }
}

static void push_audio_level(void)
{
    quailtracker_AudioLevel msg = quailtracker_AudioLevel_init_zero;

    /* Read and reset peak */
    int32_t peak = audioPeakLevel;
    audioPeakLevel = 0;

    msg.peak = (uint32_t)(peak < 0 ? 0 : peak);
    msg.activity_pct = (uint32_t)actRatio;
    msg.clip_count = limiterClipCount;
    msg.buf_used = (uint32_t)(ringHead - ringTail);
    msg.buf_capacity = PCM_RING_SIZE;

    uint8_t buf[quailtracker_AudioLevel_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_AudioLevel_fields, &msg)) {
        ble_proto_send(TOPIC_AUDIO_LEVEL, buf, stream.bytes_written);
    }
}

static void push_recording_state(void)
{
    quailtracker_RecordingState msg = quailtracker_RecordingState_init_zero;

    msg.active = isRecording ? true : false;
    strncpy(msg.filename, recFilename, sizeof(msg.filename) - 1);
    msg.bytes_written = totalDataBytes;
    msg.duration_s = isRecording ? totalDataBytes / (SAMPLE_RATE * 3) : 0;
    msg.overruns = ringOverruns;

    uint32_t total_kb, free_kb;
    get_sd_space(&total_kb, &free_kb);
    msg.sd_free_kb = free_kb;

    uint8_t buf[quailtracker_RecordingState_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_RecordingState_fields, &msg)) {
        ble_proto_send(TOPIC_RECORDING_STATE, buf, stream.bytes_written);
    }
}

static void push_config_dump(void)
{
    quailtracker_Config msg = quailtracker_Config_init_zero;

