chriskinal/QuailTracker/stm32/QuailTracker_U575/Core/Src/ble_proto_handlers.c
    msg.gain = (uint32_t)cfg.gain;
    msg.bpf_low_hz = (uint32_t)cfg.bpfLow;
    msg.bpf_high_hz = (uint32_t)cfg.bpfHigh;
    msg.sample_rate = SAMPLE_RATE;
    msg.rec_format = (uint32_t)cfg.recFormat;
    strncpy(msg.station_id, cfg.stationId, sizeof(msg.station_id) - 1);

    /* Trigger */
    msg.trig_enabled = cfg.trigEnabled ? true : false;
    msg.trig_db = (int32_t)cfg.trigDb;
    msg.trig_pre_s = (uint32_t)cfg.trigPre;
    msg.trig_post_s = (uint32_t)cfg.trigPost;

    /* Battery */
    msg.low_bat_pct = (uint32_t)cfg.lowBatPct;
    msg.auto_stop = cfg.autoStop ? true : false;

    /* Activity filter */
    msg.act_mode = (uint32_t)cfg.activityMode;
    msg.act_min_pct = (uint32_t)cfg.activityMinPct;
    msg.act_max_pct = (uint32_t)cfg.activityMaxPct;
    msg.act_hold_s = (uint32_t)cfg.activityHoldSec;

    /* Scheduling */
    msg.sunrise_enabled = cfg.sunriseEnabled ? true : false;
    msg.sunrise_before = (uint32_t)cfg.sunriseBefore;
    msg.sunrise_after = (uint32_t)cfg.sunriseAfter;
    msg.sunset_enabled = cfg.sunsetEnabled ? true : false;
    msg.sunset_before = (uint32_t)cfg.sunsetBefore;
    msg.sunset_after = (uint32_t)cfg.sunsetAfter;

    /* Time windows */
    msg.windows_count = cfg.numWindows;
    for (int i = 0; i < cfg.numWindows && i < 8; i++) {
        msg.windows[i].start_hhmm = (uint32_t)cfg.windows[i * 2];
        msg.windows[i].end_hhmm   = (uint32_t)cfg.windows[i * 2 + 1];
    }

    /* Detection */
    msg.mission_mode = (uint32_t)cfg.missionMode;
    msg.det_threshold = (uint32_t)cfg.detConfThresh;
    msg.det_step_s = (uint32_t)cfg.detWindowStep;
    msg.chunk_minutes = (uint32_t)cfg.chunkMinutes;

    /* Survey-in */
    msg.survey_lat_e7 = (int32_t)(cfg.surveyLat * 10000000.0f);
    msg.survey_lon_e7 = (int32_t)(cfg.surveyLon * 10000000.0f);
    msg.survey_alt_mm = (int32_t)(cfg.surveyAlt * 1000.0f);
    msg.survey_count = cfg.surveyCount;

    uint8_t buf[quailtracker_Config_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_Config_fields, &msg)) {
        ble_proto_send(TOPIC_CONFIG_DUMP, buf, stream.bytes_written);
    }
}

static void push_health_report(void)
{
    quailtracker_HealthReport msg = quailtracker_HealthReport_init_zero;

    /* Recording */
    msg.files_written = health.filesWritten;
    msg.total_bytes = health.totalBytes;
    msg.recording_secs = health.recordingSecs;
    strncpy(msg.last_filename, health.lastFilename, sizeof(msg.last_filename) - 1);
    msg.last_file_bytes = health.lastFileBytes;
    msg.last_file_secs = health.lastFileSecs;
    msg.write_errors = health.writeErrors;

    /* Detection */
    msg.detections = health.detections;
    strncpy(msg.last_species, health.lastSpecies, sizeof(msg.last_species) - 1);
    msg.last_confidence = (uint32_t)health.lastConfidence;
    strncpy(msg.last_det_time, health.lastDetTime, sizeof(msg.last_det_time) - 1);

    /* System */
    msg.battery_min_mv = (health.battMinMv == 0xFFFFFFFF) ? 0 : health.battMinMv;
    msg.battery_max_mv = health.battMaxMv;
    msg.temp_min_c100 = (health.tempMinC100 == 32767) ? 0 : health.tempMinC100;
    msg.temp_max_c100 = (health.tempMaxC100 == -32768) ? 0 : health.tempMaxC100;
    msg.boot_count = health.bootCount;
    msg.sd_errors = health.sdErrors;
    msg.gps_fix_losses = health.gpsFixLosses;
    msg.uptime_secs = HAL_GetTick() / 1000;

    uint8_t buf[quailtracker_HealthReport_size];
    pb_ostream_t stream = pb_ostream_from_buffer(buf, sizeof(buf));
    if (pb_encode(&stream, quailtracker_HealthReport_fields, &msg)) {
        ble_proto_send(TOPIC_HEALTH_REPORT, buf, stream.bytes_written);
    }
}

/* ---- Command handlers ---- */

static void handle_command(const uint8_t *payload, size_t payload_len)
{
    quailtracker_Command cmd = quailtracker_Command_init_zero;
    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    if (!pb_decode(&stream, quailtracker_Command_fields, &cmd)) {
        send_nack(quailtracker_CommandType_CMD_NONE, "decode");
        return;
    }

    printf("BLE PB CMD: %d\r\n", (int)cmd.type);

    switch (cmd.type) {
    case quailtracker_CommandType_CMD_REC_START:
        if (isRecording) { send_nack(cmd.type, "ALREADY"); return; }
        if (!sdMounted)  { send_nack(cmd.type, "NOSD"); return; }
        {
            uint8_t c = CMD_START_REC;
            osMessageQueuePut(audioCmdQueueHandle, &c, 0, 0);
        }
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_REC_STOP:
        if (!isRecording) { send_nack(cmd.type, "ALREADY"); return; }
        {
            uint8_t c = CMD_STOP_REC;
            osMessageQueuePut(audioCmdQueueHandle, &c, 0, 0);
        }
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_REC_TOGGLE:
        if (!isRecording && !sdMounted) { send_nack(cmd.type, "NOSD"); return; }
        {
            uint8_t c = isRecording ? CMD_STOP_REC : CMD_START_REC;
            osMessageQueuePut(audioCmdQueueHandle, &c, 0, 0);
        }
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_SD_MOUNT:
        if (sdMounted) { send_nack(cmd.type, "ALREADY"); return; }
        osMutexAcquire(fileMtxHandle, osWaitForever);
        if (f_mount(&USERFatFS, USERPath, 1) == FR_OK) {
            sdMounted = 1;
            osMutexRelease(fileMtxHandle);
            printf("BLE PB: SD mounted\r\n");
            send_ack(cmd.type);
        } else {
            osMutexRelease(fileMtxHandle);
            send_nack(cmd.type, "NOSD");
        }
        break;

    case quailtracker_CommandType_CMD_SD_EJECT:
        if (isRecording) { send_nack(cmd.type, "BUSY"); return; }
        if (!sdMounted)  { send_nack(cmd.type, "ALREADY"); return; }
        osMutexAcquire(fileMtxHandle, osWaitForever);
        f_mount(NULL, USERPath, 0);
        USER_disk_deinit();
        sdMounted = 0;
        osMutexRelease(fileMtxHandle);
        printf("BLE PB: SD ejected\r\n");
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_SD_FORMAT:
        if (isRecording) { send_nack(cmd.type, "BUSY"); return; }
        osMutexAcquire(fileMtxHandle, osWaitForever);
        {
            int ok = formatSD();
            osMutexRelease(fileMtxHandle);
            if (ok) {
                printf("BLE PB: SD formatted\r\n");
                send_ack(cmd.type);
            } else {
                send_nack(cmd.type, "NOSD");
            }
        }
        break;

    case quailtracker_CommandType_CMD_GET_STATUS:
        push_status();
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_GET_CONFIG:
        push_config_dump();
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_MODEL_RELOAD:
        if (inferenceTaskHandle != NULL) {
            osThreadFlagsSet(inferenceTaskHandle, 0x02);
            send_ack(cmd.type);
        } else {
            send_nack(cmd.type, "NOTASK");
        }
        break;

