chriskinal/QuailTracker/stm32/QuailTracker_U575/Core/Src/ble_proto_handlers.c
    case quailtracker_CommandType_CMD_MODEL_STATUS:
        /* Push status which includes model info */
        push_status();
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_DET_STATUS:
        push_status();
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_SURVEY_START:
        if (gpsData.satellites < SURVEY_MIN_SATS || gpsData.fix < 1) {
            send_nack(cmd.type, "NOSATS");
            return;
        }
        cfg.surveyLat = 0.0f;
        cfg.surveyLon = 0.0f;
        cfg.surveyAlt = 0.0f;
        cfg.surveyCount = 0;
        surveyActive = 1;
        surveyStartTick = HAL_GetTick();
        printf("BLE PB: Survey started\r\n");
        send_ack(cmd.type);
        break;

    case quailtracker_CommandType_CMD_SURVEY_STOP:
        if (surveyActive) {
            surveyActive = 0;
            configSave();
            printf("BLE PB: Survey stopped (%lu fixes)\r\n",
                   (unsigned long)cfg.surveyCount);
        }
        send_ack(cmd.type);
        push_config_dump();
        break;

    case quailtracker_CommandType_CMD_SURVEY_CLEAR:
        surveyActive = 0;
        cfg.surveyLat = 0.0f;
        cfg.surveyLon = 0.0f;
        cfg.surveyAlt = 0.0f;
        cfg.surveyCount = 0;
        configSave();
        printf("BLE PB: Survey cleared\r\n");
        send_ack(cmd.type);
        push_config_dump();
        break;

    case quailtracker_CommandType_CMD_LOGS_TOGGLE:
        bleLogEnabled = !bleLogEnabled;
        if (bleLogEnabled) {
            bleLogHead = 0;
            bleLogTail = 0;
        }
        printf("BLE PB: Log forwarding = %s\r\n", bleLogEnabled ? "ON" : "OFF");
        send_ack(cmd.type);
        break;

    default:
        send_nack(cmd.type, "UNKNOWN");
        break;
    }
}

static void handle_set_config(const uint8_t *payload, size_t payload_len)
{
    quailtracker_SetConfig sc = quailtracker_SetConfig_init_zero;
    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    if (!pb_decode(&stream, quailtracker_SetConfig_fields, &sc)) {
        send_nack(quailtracker_CommandType_CMD_NONE, "decode");
        return;
    }

    if (sc.has_gain) {
        if (sc.gain <= 24 && (sc.gain % 3) == 0) {
            cfg.gain = (uint8_t)sc.gain;
            HAL_MDF_SetGain(&AdfHandle0, (int32_t)sc.gain);
            float gc = 18.0f - (float)((int)sc.gain - 6) * 6.0f;
            mel_set_gain_compensation(gc);
            printf("BLE PB: gain=%lu\r\n", (unsigned long)sc.gain);
        }
    }
    if (sc.has_bpf_low_hz) {
        cfg.bpfLow = (uint16_t)sc.bpf_low_hz;
    }
    if (sc.has_bpf_high_hz) {
        cfg.bpfHigh = (uint16_t)sc.bpf_high_hz;
    }
    if (sc.has_rec_format) {
        if (!isRecording) {
            cfg.recFormat = (uint8_t)sc.rec_format;
            recFormat = (uint8_t)sc.rec_format;
        }
    }
    if (sc.has_station_id) {
        strncpy(cfg.stationId, sc.station_id, sizeof(cfg.stationId) - 1);
        cfg.stationId[sizeof(cfg.stationId) - 1] = '\0';
    }
    if (sc.has_trig_enabled) {
        cfg.trigEnabled = sc.trig_enabled ? 1 : 0;
    }
    if (sc.has_trig_db) {
        cfg.trigDb = (int8_t)sc.trig_db;
    }
    if (sc.has_trig_pre_s) {
        cfg.trigPre = (uint8_t)sc.trig_pre_s;
    }
    if (sc.has_trig_post_s) {
        cfg.trigPost = (uint8_t)sc.trig_post_s;
    }
    if (sc.has_low_bat_pct) {
        cfg.lowBatPct = (uint8_t)sc.low_bat_pct;
    }
    if (sc.has_auto_stop) {
        cfg.autoStop = sc.auto_stop ? 1 : 0;
    }
    if (sc.has_act_mode) {
        cfg.activityMode = (uint8_t)sc.act_mode;
    }
    if (sc.has_act_min_pct) {
        cfg.activityMinPct = (uint8_t)sc.act_min_pct;
    }
    if (sc.has_act_max_pct) {
        cfg.activityMaxPct = (uint8_t)sc.act_max_pct;
    }
    if (sc.has_act_hold_s) {
        cfg.activityHoldSec = (uint8_t)sc.act_hold_s;
    }
    if (sc.has_sunrise_enabled) {
        cfg.sunriseEnabled = sc.sunrise_enabled ? 1 : 0;
    }
    if (sc.has_sunrise_before) {
        cfg.sunriseBefore = (uint16_t)sc.sunrise_before;
    }
    if (sc.has_sunrise_after) {
        cfg.sunriseAfter = (uint16_t)sc.sunrise_after;
    }
    if (sc.has_sunset_enabled) {
        cfg.sunsetEnabled = sc.sunset_enabled ? 1 : 0;
    }
    if (sc.has_sunset_before) {
        cfg.sunsetBefore = (uint16_t)sc.sunset_before;
    }
    if (sc.has_sunset_after) {
        cfg.sunsetAfter = (uint16_t)sc.sunset_after;
    }
    if (sc.windows_count > 0) {
        int n = (int)sc.windows_count;
        if (n > 8) n = 8;
        cfg.numWindows = (uint8_t)n;
        for (int i = 0; i < n; i++) {
            cfg.windows[i * 2]     = (uint16_t)sc.windows[i].start_hhmm;
            cfg.windows[i * 2 + 1] = (uint16_t)sc.windows[i].end_hhmm;
        }
    }
    if (sc.has_mission_mode) {
        cfg.missionMode = (uint8_t)sc.mission_mode;
    }
    if (sc.has_det_threshold) {
        cfg.detConfThresh = (uint8_t)sc.det_threshold;
    }
    if (sc.has_det_step_s) {
        cfg.detWindowStep = (uint8_t)sc.det_step_s;
    }
    if (sc.has_chunk_minutes) {
        cfg.chunkMinutes = (uint8_t)sc.chunk_minutes;
    }

    if (configSave()) {
        printf("BLE PB: Config saved\r\n");
        send_ack(quailtracker_CommandType_CMD_NONE);
    } else {
        send_nack(quailtracker_CommandType_CMD_NONE, "FLASH");
    }
}

static void handle_subscribe(const uint8_t *payload, size_t payload_len)
{
    quailtracker_Subscribe sub = quailtracker_Subscribe_init_zero;
    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    if (!pb_decode(&stream, quailtracker_Subscribe_fields, &sub)) {
        return;
    }

    ble_proto_add_subscription((uint8_t)sub.topic, sub.interval_ms);

    /* Immediately push the first value */
    ble_proto_push_topic((uint8_t)sub.topic);
}

static void handle_unsubscribe(const uint8_t *payload, size_t payload_len)
{
    quailtracker_Unsubscribe unsub = quailtracker_Unsubscribe_init_zero;
    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    if (!pb_decode(&stream, quailtracker_Unsubscribe_fields, &unsub)) {
        return;
    }

    ble_proto_remove_subscription((uint8_t)unsub.topic);
}

static void handle_ping(void)
{
    /* Reply with empty Pong */
    ble_proto_send(TOPIC_PONG, NULL, 0);
}

/* ---- Public API ---- */

void ble_proto_dispatch(uint8_t topic, const uint8_t *payload, size_t payload_len)
{
    switch (topic) {
    case TOPIC_COMMAND:
        handle_command(payload, payload_len);
        break;

    case TOPIC_SET_CONFIG:
        handle_set_config(payload, payload_len);
        break;

    case TOPIC_SUBSCRIBE:
        handle_subscribe(payload, payload_len);
        break;

    case TOPIC_UNSUBSCRIBE:
        handle_unsubscribe(payload, payload_len);
        break;

    case TOPIC_PING:
        handle_ping();
        break;

    default:
        printf("BLE PB: Unknown topic 0x%02X\r\n", topic);
        break;
    }
}

void ble_proto_push_topic(uint8_t topic)
{
    switch (topic) {
    case TOPIC_STATUS:
        push_status();
        break;
    case TOPIC_GPS_FIX:
        push_gps_fix();
        break;
    case TOPIC_AUDIO_LEVEL:
        push_audio_level();
        break;
    case TOPIC_RECORDING_STATE:
        push_recording_state();
        break;
    case TOPIC_CONFIG_DUMP:
        push_config_dump();
        break;
    case TOPIC_HEALTH_REPORT:
        push_health_report();
        break;
    default:
        break;
    }
}
